fix: Structure
